clarestudio/pic32mx-template/include/pic32/iomx2dma.h
/* $Id: iomx2dma.h,v 1.2 2016/05/29 20:19:44 clare Exp $ */
/*
 * special function registers
 */
#ifndef __PIC32MX2XX_DMAC_H
#define __PIC32MX2XX_DMAC_H

/*
 * direct memory access controller registers
 */
#define DMACON		__SFR__(0xBF883000)
#define DMACONCLR	__SFR__(0xBF883004)
#define DMACONSET	__SFR__(0xBF883008)
#define DMACONINV	__SFR__(0xBF88300C)
#define DMASTAT		__SFR__(0xBF883010)
#define DMASTATCLR	__SFR__(0xBF883014)
#define DMASTATSET	__SFR__(0xBF883018)
#define DMASTATINV	__SFR__(0xBF88301C)
#define DMAADDR		__SFR__(0xBF883020)
#define DMAADDRCLR	__SFR__(0xBF883024)
#define DMAADDRSET	__SFR__(0xBF883028)
#define DMAADDRINV	__SFR__(0xBF88302C)

#define DCRCCON		__SFR__(0xBF883030)
#define DCRCCONCLR	__SFR__(0xBF883034)
#define DCRCCONSET	__SFR__(0xBF883038)
#define DCRCCONINV	__SFR__(0xBF88303C)
#define DCRCDATA	__SFR__(0xBF883040)
#define DCRCDATACLR	__SFR__(0xBF883044)
#define DCRCDATASET	__SFR__(0xBF883048)
#define DCRCDATAINV	__SFR__(0xBF88304C)
#define DCRCXOR		__SFR__(0xBF883050)
#define DCRCXORCLR	__SFR__(0xBF883054)
#define DCRCXORSET	__SFR__(0xBF883058)
#define DCRCXORINV	__SFR__(0xBF88305C)

#define DCH0CON		__SFR__(0xBF883060)
#define DCH0CONCLR	__SFR__(0xBF883064)
#define DCH0CONSET	__SFR__(0xBF883068)
#define DCH0CONINV	__SFR__(0xBF88306C)
#define DCH0ECON	__SFR__(0xBF883070)
#define DCH0ECONCLR	__SFR__(0xBF883074)
#define DCH0ECONSET	__SFR__(0xBF883078)
#define DCH0ECONINV	__SFR__(0xBF88307C)
#define DCH0INT		__SFR__(0xBF883080)
#define DCH0INTCLR	__SFR__(0xBF883084)
#define DCH0INTSET	__SFR__(0xBF883088)
#define DCH0INTINV	__SFR__(0xBF88308C)
#define DCH0SSA		__SFR__(0xBF883090)
#define DCH0SSACLR	__SFR__(0xBF883094)
#define DCH0SSASET	__SFR__(0xBF883098)
#define DCH0SSAINV	__SFR__(0xBF88309C)
#define DCH0DSA		__SFR__(0xBF8830A0)
#define DCH0DSACLR	__SFR__(0xBF8830A4)
#define DCH0DSASET	__SFR__(0xBF8830A8)
#define DCH0DSAINV	__SFR__(0xBF8830AC)
#define DCH0SSIZ	__SFR__(0xBF8830B0)
#define DCH0SSIZCLR	__SFR__(0xBF8830B4)
#define DCH0SSIZSET	__SFR__(0xBF8830B8)
#define DCH0SSIZINV	__SFR__(0xBF8830BC)
#define DCH0DSIZ	__SFR__(0xBF8830C0)
#define DCH0DSIZCLR	__SFR__(0xBF8830C4)
#define DCH0DSIZSET	__SFR__(0xBF8830C8)
#define DCH0DSIZINV	__SFR__(0xBF8830CC)
#define DCH0SPTR	__SFR__(0xBF8830D0)
#define DCH0SPTRCLR	__SFR__(0xBF8830D4)
#define DCH0SPTRSET	__SFR__(0xBF8830D8)
#define DCH0SPTRINV	__SFR__(0xBF8830DC)
#define DCH0DPTR	__SFR__(0xBF8830E0)
#define DCH0DPTRCLR	__SFR__(0xBF8830E4)
#define DCH0DPTRSET	__SFR__(0xBF8830E8)
#define DCH0DPTRINV	__SFR__(0xBF8830EC)
#define DCH0CSIZ	__SFR__(0xBF8830F0)
#define DCH0CSIZCLR	__SFR__(0xBF8830F4)
#define DCH0CSIZSET	__SFR__(0xBF8830F8)
#define DCH0CSIZINV	__SFR__(0xBF8830FC)
#define DCH0CPTR	__SFR__(0xBF883100)
#define DCH0CPTRCLR	__SFR__(0xBF883104)
#define DCH0CPTRSET	__SFR__(0xBF883108)
#define DCH0CPTRINV	__SFR__(0xBF88310C)
#define DCH0DAT		__SFR__(0xBF883110)
#define DCH0DATCLR	__SFR__(0xBF883114)
#define DCH0DATSET	__SFR__(0xBF883118)
#define DCH0DATINV	__SFR__(0xBF88311C)

#define DCH1CON		__SFR__(0xBF883120)
#define DCH1CONCLR	__SFR__(0xBF883124)
#define DCH1CONSET	__SFR__(0xBF883128)
#define DCH1CONINV	__SFR__(0xBF88312C)
#define DCH1ECON	__SFR__(0xBF883130)
#define DCH1ECONCLR	__SFR__(0xBF883134)
#define DCH1ECONSET	__SFR__(0xBF883138)
#define DCH1ECONINV	__SFR__(0xBF88313C)
#define DCH1INT		__SFR__(0xBF883140)
#define DCH1INTCLR	__SFR__(0xBF883144)
#define DCH1INTSET	__SFR__(0xBF883148)
#define DCH1INTINV	__SFR__(0xBF88314C)
#define DCH1SSA		__SFR__(0xBF883150)
#define DCH1SSACLR	__SFR__(0xBF883154)
#define DCH1SSASET	__SFR__(0xBF883158)
#define DCH1SSAINV	__SFR__(0xBF88315C)
#define DCH1DSA		__SFR__(0xBF883160)
#define DCH1DSACLR	__SFR__(0xBF883164)
#define DCH1DSASET	__SFR__(0xBF883168)
#define DCH1DSAINV	__SFR__(0xBF88316C)
#define DCH1SSIZ	__SFR__(0xBF883170)
#define DCH1SSIZCLR	__SFR__(0xBF883174)
#define DCH1SSIZSET	__SFR__(0xBF883178)
#define DCH1SSIZINV	__SFR__(0xBF88317C)
#define DCH1DSIZ	__SFR__(0xBF883180)
#define DCH1DSIZCLR	__SFR__(0xBF883184)
#define DCH1DSIZSET	__SFR__(0xBF883188)
#define DCH1DSIZINV	__SFR__(0xBF88318C)
#define DCH1SPTR	__SFR__(0xBF883190)
#define DCH1SPTRCLR	__SFR__(0xBF883194)
#define DCH1SPTRSET	__SFR__(0xBF883198)
#define DCH1SPTRINV	__SFR__(0xBF88319C)
#define DCH1DPTR	__SFR__(0xBF8831A0)
#define DCH1DPTRCLR	__SFR__(0xBF8831A4)
#define DCH1DPTRSET	__SFR__(0xBF8831A8)
#define DCH1DPTRINV	__SFR__(0xBF8831AC)
#define DCH1CSIZ	__SFR__(0xBF8831B0)
#define DCH1CSIZCLR	__SFR__(0xBF8831B4)
#define DCH1CSIZSET	__SFR__(0xBF8831B8)
#define DCH1CSIZINV	__SFR__(0xBF8831BC)
#define DCH1CPTR	__SFR__(0xBF8831C0)
#define DCH1CPTRCLR	__SFR__(0xBF8831C4)
#define DCH1CPTRSET	__SFR__(0xBF8831C8)
#define DCH1CPTRINV	__SFR__(0xBF8831CC)
#define DCH1DAT		__SFR__(0xBF8831D0)
#define DCH1DATCLR	__SFR__(0xBF8831D4)
#define DCH1DATSET	__SFR__(0xBF8831D8)
#define DCH1DATINV	__SFR__(0xBF8831DC)

#define DCH2CON		__SFR__(0xBF8831E0)
#define DCH2CONCLR	__SFR__(0xBF8831E4)
#define DCH2CONSET	__SFR__(0xBF8831E8)
#define DCH2CONINV	__SFR__(0xBF8831EC)
#define DCH2ECON	__SFR__(0xBF8831F0)
#define DCH2ECONCLR	__SFR__(0xBF8831F4)
#define DCH2ECONSET	__SFR__(0xBF8831F8)
#define DCH2ECONINV	__SFR__(0xBF8831FC)
#define DCH2INT		__SFR__(0xBF883200)
#define DCH2INTCLR	__SFR__(0xBF883204)
#define DCH2INTSET	__SFR__(0xBF883208)
#define DCH2INTINV	__SFR__(0xBF88320C)
#define DCH2SSA		__SFR__(0xBF883210)
#define DCH2SSACLR	__SFR__(0xBF883214)
#define DCH2SSASET	__SFR__(0xBF883218)
#define DCH2SSAINV	__SFR__(0xBF88321C)
#define DCH2DSA		__SFR__(0xBF883220)
#define DCH2DSACLR	__SFR__(0xBF883224)
#define DCH2DSASET	__SFR__(0xBF883228)
#define DCH2DSAINV	__SFR__(0xBF88322C)
#define DCH2SSIZ	__SFR__(0xBF883230)
#define DCH2SSIZCLR	__SFR__(0xBF883234)
#define DCH2SSIZSET	__SFR__(0xBF883238)
#define DCH2SSIZINV	__SFR__(0xBF88323C)
#define DCH2DSIZ	__SFR__(0xBF883240)
#define DCH2DSIZCLR	__SFR__(0xBF883244)
#define DCH2DSIZSET	__SFR__(0xBF883248)
#define DCH2DSIZINV	__SFR__(0xBF88324C)
#define DCH2SPTR	__SFR__(0xBF883250)
#define DCH2SPTRCLR	__SFR__(0xBF883254)
#define DCH2SPTRSET	__SFR__(0xBF883258)
#define DCH2SPTRINV	__SFR__(0xBF88325C)
#define DCH2DPTR	__SFR__(0xBF883260)
#define DCH2DPTRCLR	__SFR__(0xBF883264)
#define DCH2DPTRSET	__SFR__(0xBF883268)
#define DCH2DPTRINV	__SFR__(0xBF88326C)
#define DCH2CSIZ	__SFR__(0xBF883270)
#define DCH2CSIZCLR	__SFR__(0xBF883274)
#define DCH2CSIZSET	__SFR__(0xBF883278)
#define DCH2CSIZINV	__SFR__(0xBF88327C)
#define DCH2CPTR	__SFR__(0xBF883280)
#define DCH2CPTRCLR	__SFR__(0xBF883284)
#define DCH2CPTRSET	__SFR__(0xBF883288)
#define DCH2CPTRINV	__SFR__(0xBF88328C)
#define DCH2DAT		__SFR__(0xBF883290)
#define DCH2DATCLR	__SFR__(0xBF883294)
#define DCH2DATSET	__SFR__(0xBF883298)
#define DCH2DATINV	__SFR__(0xBF88329C)

#define DCH3CON		__SFR__(0xBF8832A0)
#define DCH3CONCLR	__SFR__(0xBF8832A4)
#define DCH3CONSET	__SFR__(0xBF8832A8)
#define DCH3CONINV	__SFR__(0xBF8832AC)
#define DCH3ECON	__SFR__(0xBF8832B0)
#define DCH3ECONCLR	__SFR__(0xBF8832B4)
#define DCH3ECONSET	__SFR__(0xBF8832B8)
#define DCH3ECONINV	__SFR__(0xBF8832BC)
#define DCH3INT		__SFR__(0xBF8832C0)
#define DCH3INTCLR	__SFR__(0xBF8832C4)
#define DCH3INTSET	__SFR__(0xBF8832C8)
#define DCH3INTINV	__SFR__(0xBF8832CC)
#define DCH3SSA		__SFR__(0xBF8832D0)
#define DCH3SSACLR	__SFR__(0xBF8832D4)
#define DCH3SSASET	__SFR__(0xBF8832D8)
#define DCH3SSAINV	__SFR__(0xBF8832DC)
#define DCH3DSA		__SFR__(0xBF8832E0)
#define DCH3DSACLR	__SFR__(0xBF8832E4)
#define DCH3DSASET	__SFR__(0xBF8832E8)
#define DCH3DSAINV	__SFR__(0xBF8832EC)
#define DCH3SSIZ	__SFR__(0xBF8832F0)
#define DCH3SSIZCLR	__SFR__(0xBF8832F4)
#define DCH3SSIZSET	__SFR__(0xBF8832F8)
#define DCH3SSIZINV	__SFR__(0xBF8832FC)
#define DCH3DSIZ	__SFR__(0xBF883300)
#define DCH3DSIZCLR	__SFR__(0xBF883304)
#define DCH3DSIZSET	__SFR__(0xBF883308)
#define DCH3DSIZINV	__SFR__(0xBF88330C)
#define DCH3SPTR	__SFR__(0xBF883310)
#define DCH3SPTRCLR	__SFR__(0xBF883314)
#define DCH3SPTRSET	__SFR__(0xBF883318)
#define DCH3SPTRINV	__SFR__(0xBF88331C)
#define DCH3DPTR	__SFR__(0xBF883320)
#define DCH3DPTRCLR	__SFR__(0xBF883324)
#define DCH3DPTRSET	__SFR__(0xBF883328)
#define DCH3DPTRINV	__SFR__(0xBF88332C)
#define DCH3CSIZ	__SFR__(0xBF883330)
#define DCH3CSIZCLR	__SFR__(0xBF883334)
#define DCH3CSIZSET	__SFR__(0xBF883338)
#define DCH3CSIZINV	__SFR__(0xBF88333C)
#define DCH3CPTR	__SFR__(0xBF883340)
#define DCH3CPTRCLR	__SFR__(0xBF883344)
#define DCH3CPTRSET	__SFR__(0xBF883348)
#define DCH3CPTRINV	__SFR__(0xBF88334C)
#define DCH3DAT		__SFR__(0xBF883350)
#define DCH3DATCLR	__SFR__(0xBF883354)
#define DCH3DATSET	__SFR__(0xBF883358)
#define DCH3DATINV	__SFR__(0xBF88335C)

#endif
